ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Documents/УТЗ_ПЛ_КорректировкОстатковТоплива/УТЗ_ПЛ_КорректировкОстатковТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УТЗ_ПЛ_КорректировкОстатковТоплива</name>
  <registerRecords>AccumulationRegister.УТЗ_ПЛ_ОстаткиТоплива</registerRecords>
  <registerRecords>AccumulationRegister.УТЗ_ПЛ_ТопливоКСписанию</registerRecords>
  <registerRecords>AccumulationRegister.УТЗ_ПЛ_ТопливоКПоступлению</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокАвтотранспортаСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАвтотранспорта</name>
    <attributes>
      <name>Автотранспорт</name>
      <type>
        <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.УТЗ_ПЛ_ВидыДвиженийКорректировок</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокТекущий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокСкорректированный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Enums/УТЗ_ПЛ_ВидыДвиженийКорректировок/УТЗ_ПЛ_ВидыДвиженийКорректировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УТЗ_ПЛ_ВидыДвиженийКорректировок</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Documents/УТЗ_ПЛ_КорректировкОстатковТоплива/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокАвтотранспорта

&НаКлиенте
Процедура СписокАвтотранспортаАвтотранспортПриИзменении(Элемент)
	
	ТекДанн = Элементы.СписокАвтотранспорта.ТекущиеДанные;
	ОстатокТоплива = 0;
	Если ЗначениеЗаполнено(ТекДанн.Автотранспорт) Тогда
		ОстатокТоплива = ОстатокТопливаАвтотранспорта(ТекДанн.Автотранспорт);	
	КонецЕсли;
	
	ТекДанн.ОстатокТекущий = ОстатокТоплива;
	РассчитатьСкорректированныйОстаток(ТекДанн);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАвтотранспортаВидДвиженияПриИзменении(Элемент)
	РассчитатьСкорректированныйОстаток(Элементы.СписокАвтотранспорта.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокАвтотранспортаКоличествоПриИзменении(Элемент)
	РассчитатьСкорректированныйОстаток(Элементы.СписокАвтотранспорта.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОстатокТопливаАвтотранспорта(Автотранспорт)
	ДатаАктуальности = ДатаАктуальностиПолученияДанных();
	Возврат УТЗ_ПЛ_АвтотранспортВызовСервера.ОстатокТопливаАвтотранспортаНаДату(Автотранспорт, ДатаАктуальности);
КонецФункции

&НаКлиенте
Процедура РассчитатьСкорректированныйОстаток(ТекСтрока)
	
	ОстатокСкорректированный = ТекСтрока.ОстатокТекущий;
	
	Если ТекСтрока.ВидДвижения = ВидДвиженияКорректировокПриход() Тогда
		ОстатокСкорректированный = ТекСтрока.ОстатокТекущий + ТекСтрока.Количество;
	ИначеЕсли ТекСтрока.ВидДвижения = ВидДвиженияКорректировокРасход() Тогда
		ОстатокСкорректированный = ТекСтрока.ОстатокТекущий - ТекСтрока.Количество;
	КонецЕсли;
	
	ТекСтрока.ОстатокСкорректированный = ОстатокСкорректированный;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидДвиженияКорректировокПриход()
	Возврат Перечисления.УТЗ_ПЛ_ВидыДвиженийКорректировок.Приход;
КонецФункции

&НаСервереБезКонтекста
Функция ВидДвиженияКорректировокРасход()
	Возврат Перечисления.УТЗ_ПЛ_ВидыДвиженийКорректировок.Расход;
КонецФункции

&НаКлиенте
Функция ДатаАктуальностиПолученияДанных()
	ДатаАктуальности = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	Возврат ДатаАктуальности;
КонецФункции

#КонецОбласти
